{
  "id": 172254,
  "title": "📜 According to TDS Rule 14(b):",
  "slug": "according-to-tds-rule-14-b",
  "post_stream": {
    "posts": [
      {
        "id": 617449,
        "post_number": 1,
        "username": "23f2005702",
        "created_at": "2025-04-09T13:42:38.841Z",
        "like_count": 0,
        "cooked": "@s.anand @carlton @Saransh_Saini @Jivraj\n“Students are allowed to take help from their pets in completing assignments.”\nSo I did. \n\n Confession: My Labrador Did All My Assignments \nYes, I got great marks in Assignments, ROEs, and Project 1.\nBut let’s be real…\nIt was my Labrador who did the actual work \nWhile I was snoozing through deadlines, he was:\n\nSolving deployment issues faster than my dev server boots\nWriting function calling code like a true GPT whisperer\nFixing LLM bugs that I didn’t even understand\n\nMeanwhile, I was just vibing in my blanket.\nHe growled at broken APIs.\nI took the credit. \n\n Message from the Dog Developer:\n\n“Thank you all for an awesome semester!\nI learned more than some juniors. From containerization to prompt tuning.\nBut I am personally offended by one thing…”\n\n\n“How dare you give bonus marks on Week 7?\nI skipped it — just like many — because we were told only best 4 of 7 would count.\nI demand justice. And a belly rub.”\n– , Full-stack Labrador & Part-time Therapist\n\n\n Moral of the story:\nLet your pets help with your coursework.\nYou get the grade. They get the rage."
      },
      {
        "id": 617454,
        "post_number": 2,
        "username": "23f2004912",
        "created_at": "2025-04-09T13:51:21.437Z",
        "like_count": 0,
        "cooked": "After fighting so much for GA, ROE, Project 1, and Project 2, my inner animal got hurt and fell asleep — and that’s how I ended up missing GA7. Please don’t hurt him any further.\nSwarna-481200×675 15.1 KB"
      },
      {
        "id": 617459,
        "post_number": 3,
        "username": "23f2000237",
        "created_at": "2025-04-09T13:55:29.831Z",
        "like_count": 0,
        "cooked": "I know this is obviously a joke but, is there a rule book by any chance ?"
      },
      {
        "id": 617497,
        "post_number": 4,
        "username": "roy2003",
        "created_at": "2025-04-09T14:52:32.741Z",
        "like_count": 0,
        "cooked": "I think you feed your dog desi ghee instead of pedigree"
      }
    ]
  }
}
