{
  "id": 168384,
  "title": "Clarification regarding Mock ROE Timings",
  "slug": "clarification-regarding-mock-roe-timings",
  "post_stream": {
    "posts": [
      {
        "id": 599262,
        "post_number": 1,
        "username": "24f2006531",
        "created_at": "2025-02-25T05:11:07.182Z",
        "like_count": 0,
        "cooked": "Hello Sir,\nI understand from the email we received that there are three mock ROEs scheduled. I wanted to check if it is mandatory to attempt the mock at 7 PM or if there is flexibility in the timing. As a working professional, I may not be able to attempt the mock at 7 PM.\nCould you please confirm if there is any flexibility in the timings? Additionally, I would appreciate it if you could provide details on when and how the mock links will be shared.\nThanks and Regards\nShalini"
      },
      {
        "id": 599274,
        "post_number": 2,
        "username": "22f3002248",
        "created_at": "2025-02-25T05:34:01.922Z",
        "like_count": 0,
        "cooked": "Tag the TAs and instructor. Otherwise, you may not get the answer in time…"
      },
      {
        "id": 599293,
        "post_number": 3,
        "username": "carlton",
        "created_at": "2025-02-25T05:52:51.182Z",
        "like_count": 0,
        "cooked": "It is not mandatory to attempt mocks at 7pm. But we will solve it in real time during the session. Thats why we are releasing it 1 hour before. We will freeze the form submissions during the solving session and then reopen it later.\nROE is not like other exams you have done so far in this entire diploma.\nSolving it leisurely will give you a false sense of your capabilities.\nThe truth is everyone can get full marks for ROE given enough time.\nThe problem is the lack of time.\nSo if you want to really check ROE readiness, fix the timer alarm for 45 mins and attempt it genuinely within the 45 mins. Only then will you know where you stand.\nAdditionally, each ROE is completely different from the next. If you manage to do good in one is ZERO guarantee that you will do good in the next.\nThats why do all 4 mock ROEs. ROE is not like any other exam. Other exams have the same types of questions. Not with ROE.\nThe real ROE will be also something that no one has seen before.\nBut we will help you be as ready as possible for it.\nKind regards"
      },
      {
        "id": 599475,
        "post_number": 4,
        "username": "23f2003413",
        "created_at": "2025-02-25T10:38:35.694Z",
        "like_count": 0,
        "cooked": "hi @carlton\nhow are we supposed to give the mock ROE? where can I find the link? should i join gmeet while solving mock ROE or is it non-proctored? kindly clarify these doubts. thanks in advance!"
      },
      {
        "id": 599484,
        "post_number": 5,
        "username": "carlton",
        "created_at": "2025-02-25T10:58:33.712Z",
        "like_count": 0,
        "cooked": "You will get an email at 7pm with the ROE dataset and the question form.\nI will also add the same in the student seek portal.\nMock ROEs are not proctored (its a mock!) and the actual ROE is not proctored either!\nThe gmeet is after the mock ROE where it will be solved live by the TDS team.\nKind regards"
      },
      {
        "id": 599570,
        "post_number": 6,
        "username": "23f1002382",
        "created_at": "2025-02-25T13:05:15.578Z",
        "like_count": 0,
        "cooked": "3 questions:-\n\nwill the questions and dataset be available after time limit?\nwill the solutions be available for later reference with the questions?\nwill the live solving video lecture be recorded?\n"
      },
      {
        "id": 599576,
        "post_number": 7,
        "username": "carlton",
        "created_at": "2025-02-25T13:10:30.614Z",
        "like_count": 0,
        "cooked": "\n\n\n 23f1002382:\n\nwill the questions and dataset be available after time limit?\n\n\nThey will be available after the live session has finished.\n\n\n\n 23f1002382:\n\nwill the solutions be available for later reference with the questions?\n\n\nWe will provide an answer script for Mock ROE1\n\n\n\n 23f1002382:\n\nwill the live solving video lecture be recorded?\n\n\nYes our live sessions will be recorded."
      },
      {
        "id": 599582,
        "post_number": 8,
        "username": "23f1002382",
        "created_at": "2025-02-25T13:14:38.360Z",
        "like_count": 0,
        "cooked": "thanks for the prompt response! Cheers . Also to my understanding at sharp 7:00 we get email with form link and questions dataset?"
      },
      {
        "id": 599597,
        "post_number": 9,
        "username": "23f2000573",
        "created_at": "2025-02-25T13:36:56.128Z",
        "like_count": 0,
        "cooked": "Hi @carlton , I will not be able to solve the mock in the given time due to other commitments. The grading document says 2 marks bonus for mocks. Will this be a part of that? If yes, is there any other way? As you have mentioned, I will keep a timer and try to solve it in 45 minutes."
      },
      {
        "id": 600214,
        "post_number": 10,
        "username": "shubhamatkal",
        "created_at": "2025-02-26T10:21:12.253Z",
        "like_count": 0,
        "cooked": "\n\n\n carlton:\n\nNo, we do not provide solutions as a notebook. The ROE will be solved during the live session.\n\n\nyes in live session ROE was solved but while taking reference for Q1 from live session from TAs to see how this question might be solved as i was getting wrong answer, but TA also didnt solved that question in correct manner he got wrong, I think we should have at least 1 standard ref for all the questions of this mock roe to understand our mistakes in solving this questions pls understand thanks,\nalso when i went throught live session recording i can see only 1 screen of 1 ta"
      },
      {
        "id": 600331,
        "post_number": 11,
        "username": "Jivraj",
        "created_at": "2025-02-26T13:58:52.609Z",
        "like_count": 0,
        "cooked": "Hi @shubhamatkal ,\nFor question1 provided answer is wrong.\nRegarding yesterday’s ROE we will send out ipynb with snippets of code that’s requried to solve questions.\nFor Today’s ROE you will be able to check answers immediately\nFor Thrusday’s ROE as well there will be some mechanism for checking answers.\nKind regards."
      }
    ]
  }
}
