{
  "id": 166303,
  "title": "LLM what rocket science going on here",
  "slug": "llm-what-rocket-science-going-on-here",
  "post_stream": {
    "posts": [
      {
        "id": 590718,
        "post_number": 1,
        "username": "21f3002112",
        "created_at": "2025-02-05T05:04:10.385Z",
        "like_count": 0,
        "cooked": "The lectures primarily focus on surface-level explanations without ensuring a strong foundational understanding of the topics. Key concepts, such as Large Language Models (LLMs) and related technologies, are not explained in a structured manner, making it difficult for students to follow."
      },
      {
        "id": 590720,
        "post_number": 2,
        "username": "21f3002112",
        "created_at": "2025-02-05T05:06:15.787Z",
        "like_count": 0,
        "cooked": "@carlton sir i watch live session recording , but still not getting some useful from it , I am talking about week 3 content in llm , these words are never heard by us so please try to tech from basic things please . At least tell us , what is llm and what is use of , everything is going to above of our head ."
      },
      {
        "id": 591055,
        "post_number": 3,
        "username": "carlton",
        "created_at": "2025-02-06T05:49:08.446Z",
        "like_count": 0,
        "cooked": "Hi Hari,\nThe goal of the course was never to go deep into specific technologies, with perhaps the exception of LLMs as major tooling capability for data science. Due to the volume of the content in the first 3 weeks it was decided to at least get students sufficient information to be able to do the Graded Assignments. One of the criticisms we received last term was that the sessions were too slow because we were covering from the very basics. So it was a conscious decision to speed up and shorten the explanations. Of course this is always difficult to get right because we respond to students in sessions. This is why attending the sessions is more valuable than watching the sessions. We cannot effectively gauge what level to pitch at if the audience is silent or not involved. We can only guess the level of the vast silent mass of students. The quality of sessions only improve when the sessions are interactive and well attended.\nHave you watched this session in particular?\n\n\n\n\nIf thats insufficient for you last term we did a 2hr 48 min session on just introducing it\n\n\n\n\nfollowed by another 2 hour detailed explanation of the more advanced use cases\n\n\n\n\nBut of course does everyone want to watch 5.5 hours of sessions to understand it? That depends on the student.\nUltimately the best you can get out of sessions is by actually attending them because only then can we address gaps in understanding.\nKind regards"
      }
    ]
  }
}
