{
  "id": 166866,
  "title": "--Request for postponing the Project -1 deadline-- Official Response: Extended :)",
  "slug": "request-for-postponing-the-project-1-deadline-official-response-extended",
  "post_stream": {
    "posts": [
      {
        "id": 594132,
        "post_number": 1,
        "username": "vikramjncasr",
        "created_at": "2025-02-12T14:07:52.960Z",
        "like_count": 0,
        "cooked": "Hello @carlton and @Jivraj   and  @s.anand sir\nIt is becoming quite evident that a lot of us will struggle to get something decent out for the project-1 by saturday and we are struggling here. I request to reconsider the deadline and extend the due date so that it gives slightly more odds of submitting the project.\nThanks\nVikram"
      },
      {
        "id": 594661,
        "post_number": 2,
        "username": "22f1000376",
        "created_at": "2025-02-13T18:22:49.380Z",
        "like_count": 0,
        "cooked": "@carlton @s.anand Yes Sir please extend the project deadline."
      },
      {
        "id": 594663,
        "post_number": 3,
        "username": "22f3000276",
        "created_at": "2025-02-13T18:27:23.305Z",
        "like_count": 0,
        "cooked": "yes, it is quite difficult and also the people who have done this course in previous terms are able to help just because of the difficulty. please extend the deadline or give out some resources."
      },
      {
        "id": 594665,
        "post_number": 4,
        "username": "23f2004636",
        "created_at": "2025-02-13T18:28:14.505Z",
        "like_count": 0,
        "cooked": "Yes @s.anand , @carlton ,\nThe project is complex, and an extension would really help reduce our stress and let us submit better work.\nAdditionally, some extra help sessions would be really helpful to clarify our doubts."
      },
      {
        "id": 594666,
        "post_number": 5,
        "username": "23f2004563",
        "created_at": "2025-02-13T18:33:03.508Z",
        "like_count": 0,
        "cooked": "@carlton @s.anand yes sir please extend the project deadline."
      },
      {
        "id": 594667,
        "post_number": 6,
        "username": "sharik4real",
        "created_at": "2025-02-13T18:34:08.893Z",
        "like_count": 0,
        "cooked": "Sir please extend the deadline it’s really hard to do we need more time"
      },
      {
        "id": 594668,
        "post_number": 7,
        "username": "Mystic_9803",
        "created_at": "2025-02-13T18:34:27.419Z",
        "like_count": 0,
        "cooked": "Yes, it’s too hectic to balance work and this project"
      },
      {
        "id": 594669,
        "post_number": 8,
        "username": "Rishabh2",
        "created_at": "2025-02-13T18:36:17.170Z",
        "like_count": 0,
        "cooked": "@carlton @s.anand sir plss extend deadline as it is taking too much time to understand the project and this is completely new for us, we are trying our best but couldn’t able to make it. Some days extension might reduce our stress and we’ll perform better in the project as this is very important for us."
      },
      {
        "id": 594671,
        "post_number": 10,
        "username": "23f1002279",
        "created_at": "2025-02-13T18:40:18.167Z",
        "like_count": 0,
        "cooked": "@carlton @s.anand  sir pls extend the deadline as the GATE DA exam is also scheduled on Saturday"
      },
      {
        "id": 594672,
        "post_number": 11,
        "username": "varun_parashar",
        "created_at": "2025-02-13T18:46:47.187Z",
        "like_count": 0,
        "cooked": "Please extend the deadline "
      },
      {
        "id": 594673,
        "post_number": 12,
        "username": "22f2001175",
        "created_at": "2025-02-13T18:48:25.522Z",
        "like_count": 0,
        "cooked": "@s.anand @carlton sir pls extend the deadline of project1 as it’s very difficult,  we are spending so much of time still not able to complete the project and the gate exam is also on 15 February. We would be grateful if the deadline could be extended…"
      },
      {
        "id": 594674,
        "post_number": 13,
        "username": "22f3000819",
        "created_at": "2025-02-13T18:52:24.978Z",
        "like_count": 0,
        "cooked": "Please at least make it 16 or 17 Feb. The GATE DA exam and project deadline coinciding has already hampered progress on both ends. At least the project will be much better even with the smallest possible extension."
      },
      {
        "id": 594686,
        "post_number": 14,
        "username": "23f2003413",
        "created_at": "2025-02-13T19:58:12.870Z",
        "like_count": 0,
        "cooked": "Kindly consider the request and extend the deadline sir. It would be really helpful as we could atleast work upto our full potential and submit few tasks increasing the odds of our submission. @carlton @s.anand"
      },
      {
        "id": 594688,
        "post_number": 15,
        "username": "AYUSH_SINGH",
        "created_at": "2025-02-13T20:37:40.537Z",
        "like_count": 0,
        "cooked": "Indeed, even i am stuck in project parts and a lot of them.\nEXTEND !!!"
      },
      {
        "id": 594690,
        "post_number": 16,
        "username": "Flibon",
        "created_at": "2025-02-13T21:44:36.410Z",
        "like_count": 0,
        "cooked": "Kindly consider our request to extend the deadline, as many students have their GATE exam on Saturday. A slight extension would be greatly helpful."
      },
      {
        "id": 594711,
        "post_number": 17,
        "username": "22f3000107",
        "created_at": "2025-02-14T03:44:17.169Z",
        "like_count": 0,
        "cooked": "SIr please extend the deadline of project 1 give us  2 to 3 days it was helpful for us."
      },
      {
        "id": 594815,
        "post_number": 18,
        "username": "carlton",
        "created_at": "2025-02-14T06:44:21.075Z",
        "like_count": 0,
        "cooked": "@22f1000376 @22f3000276 @23f2004636 @23f2004563 @sharik4real @Mystic_9803 @Rishabh2 @23f1002279 @varun_parashar @22f2001175\nand others…\nI have discussed this with the rest of the TDS team and with Operations on multiple occasions (including today.) Here are the highlights of the discussion:\n\nWe have moved Graded Assignment 5 (GA5) deadline which was due on 16th Feb to 21st Feb next Friday.\nAll the material to be able to do Project was available in Module 2 and Module 3, which was released on or before 10th of January (36 days ago)\nProject 1 was released 19th of January (27 days ago)\nWe had over 9 hours of sessions exclusively covering Project 1 (of which at least 8 hours are available on YouTube.) This excludes any week 2 and week 3 content which also would have given you the necessary skills to do Project 1. The sessions on YouTube give you a start to finish overview of how to approach it.\n\nAll of your concerns were duly noted and mentioned. Considering all the above, including the concerns mentioned by students:\nProject 1 deadline will NOT be changed.\nPlease make sure to carefully read the Deliverables and the Evaluation section and do them carefully and watch the intro to Week 3 - Session 1 to get an overview of what is absolutely essential and required. Watch Week 5 both sessions to see how we construct these requirements.\nKind regards\nTDS Team"
      },
      {
        "id": 594818,
        "post_number": 19,
        "username": "ShahbaazSingh",
        "created_at": "2025-02-14T06:50:15.092Z",
        "like_count": 0,
        "cooked": "-Yes sir this project 1 is very tough for even 1 question a whole day is used.\n@carlton @s.anand Sir besides this project we have other subject graded assignments and MLP Project and MAD2 project.\nPlease sir it would be very beneficial for everyone, we have talked to other students also we are not able to even complete the 10 A tasks even with the evaluate.py rest aside Task B.\nPlease sir take this into consideration. We are trying very hard for this project even you can see students asking various questions in the discourse, we are struggling but still sir we are trying."
      },
      {
        "id": 594905,
        "post_number": 20,
        "username": "sha_512_av",
        "created_at": "2025-02-14T10:38:25.088Z",
        "like_count": 0,
        "cooked": "@carlton @Jivraj @s.anand\nWe truly appreciate the efforts being put by the TDS team, but not to be rude here -\n\n\nWhy is Project 1 deadline is on Saturday and not on Sunday, as many of us are doing the course not as a full-time student. (Some have Gate exam on Saturday also). So, extending the timeline to at least Sunday, 16th Feb would be truly appreciated.\n\n\nWeek 3 release date timeline is 24 Jan, we need adequate time to go through the weekly materials. All the contents are already released, so by the same logic upcoming Project 2 contents are also available but that doesn’t mean that we can complete the upcoming project within a week.\n\n\nProject help sessions came on 11th February(live) and 12th Feb on YouTube, just 4 days before the submission date, though I am not complaining about this and genuinely appreciating the team’s effort, but this does gives very less time for many of us here.\n\n\nThank you."
      },
      {
        "id": 594914,
        "post_number": 21,
        "username": "HarshJaiswal",
        "created_at": "2025-02-14T11:38:25.143Z",
        "like_count": 0,
        "cooked": "sir…please extend the deadline…"
      }
    ]
  }
}
