{
  "id": 167471,
  "title": "Project 1 Submission Marked as FAIL Despite Having Dockerfile & Image",
  "slug": "project-1-submission-marked-as-fail-despite-having-dockerfile-image",
  "post_stream": {
    "posts": [
      {
        "id": 596311,
        "post_number": 1,
        "username": "21f3002647",
        "created_at": "2025-02-17T10:07:56.783Z",
        "like_count": 0,
        "cooked": "Dear TDS Team,\nI have verified my submission, and my repository does include a Dockerfile, and the Docker image is accessible on DockerHub. Please find the attached screenshot as proof. Kindly review my submission again and let me know if any further action is needed.\nLooking forward to your confirmation.\nBest regards,\nArnav Mehta\n(21f3002647)\nimage250×534 3.92 KB\nimage713×238 11 KB"
      },
      {
        "id": 596337,
        "post_number": 2,
        "username": "21f3002647",
        "created_at": "2025-02-17T12:30:15.244Z",
        "like_count": 0,
        "cooked": "@Saransh_Saini sir what should i do?"
      },
      {
        "id": 596404,
        "post_number": 3,
        "username": "Saransh_Saini",
        "created_at": "2025-02-17T15:43:39.614Z",
        "like_count": 0,
        "cooked": "@carlton Kindly have a look into this."
      },
      {
        "id": 596467,
        "post_number": 8,
        "username": "satviksawhney",
        "created_at": "2025-02-18T00:48:03.881Z",
        "like_count": 0,
        "cooked": "Good Morning Sir,\nSir even I am facing a similar issue, even though sanity check for docker image on docker hub was cleared but got a mail saying ‘dockerfile’ not present in the GitHub repo while it clearly was. Sir please look into it we have given so many days to complete this project.\nLooking forward to your reply.\nThank you\nSatvik Sawhney\n23f2003680"
      },
      {
        "id": 596517,
        "post_number": 9,
        "username": "carlton",
        "created_at": "2025-02-18T05:00:31.191Z",
        "like_count": 0,
        "cooked": "So the reason for the failure is:\nYou had initially put your Dockerfile inside a directory called TDSP-1-main instead of being directly in your repo. (On 15th Feb 1:26AM)\nThen when our automated script checked if students repos met the requirements and yours did not we immediately sent out a warning email as a opportunity for students to make the necessary corrections.\nThen once you realised your mistake, on Feb 17th at 9:11 pm IST i.e yesteday, you changed your repo to put the files in the correct locations.\nThen you finally posted here on Discourse with the image [quote=“21f3002647, post:1, topic:167471”]\nimage250×534 3.92 KB\n[/quote]\nshowing that your files are in the correct place.\nWe do not take into consideration modifications to your repo after the deadline because then we would have to extend that curtesy to all students.\nKind regards"
      },
      {
        "id": 596587,
        "post_number": 10,
        "username": "21f3002647",
        "created_at": "2025-02-18T06:35:49.560Z",
        "like_count": 0,
        "cooked": "@carlton sir\nYes, I corrected my repo at 9:11 PM IST, but I had actually written and submitted my query much earlier at 4 PM. At that time, I wasn’t entirely sure if this was the actual issue, but it looks like it was.\nI understand that the deadline had already passed, and I only saw the email later. I had two GATE papers on the 15th and an interview on the 16th, so I was extremely busy and couldn’t check my emails sooner. However, I had raised my concern well before making the correction, so I’d really appreciate it if my submission could still be considered \nKind regards,\nArnav Mehta\n21f3002647"
      },
      {
        "id": 596639,
        "post_number": 11,
        "username": "satviksawhney",
        "created_at": "2025-02-18T08:28:16.577Z",
        "like_count": 0,
        "cooked": "Sir, please consider it we have spent a lot of time, in my case just the d in Dockerfile was small that too on remote repository. On my local repository it was Dockerfile only I even have a published docker image as verified by you autated script only. The name of the file on remote repository did not change even after commit it through my local repo, once I read the mail in morning it was only then I realised it wasn’t changed on GitHub repo.\nSir I understand the deadline has passed and I am not asking for a resubmission, I am just asking to consider the already submitted work, just that. It would be really helpful. I just have one commit on my repo that too “Rename dockerfile to Dokerfile” . Sir please attest consider what we have already submitted. I have made no changes as you can verify it too.\nSir it is a humble request to please consider it.\nWarm Regards,\nSatvik Sawhney\n23f2003680\nScreenshot 2025-02-18 at 1.53.10 PM1889×467 54 KB"
      }
    ]
  }
}
