{
  "id": 171798,
  "title": "Repeat course",
  "slug": "repeat-course",
  "post_stream": {
    "posts": [
      {
        "id": 615457,
        "post_number": 1,
        "username": "Sagan",
        "created_at": "2025-04-05T06:12:14.723Z",
        "like_count": 0,
        "cooked": "Even if I pass in end term TDS, Can I repeat the course in next term because I missed project1 and my CGPA will go down because of it?\nThis is my last term of diploma. So, can I take 1 diploma course and rest degree courses in next term?"
      },
      {
        "id": 615458,
        "post_number": 2,
        "username": "lakshaygarg654",
        "created_at": "2025-04-05T06:15:08.290Z",
        "like_count": 0,
        "cooked": "Yes, you can.\nMore details given in student handbook. Search for repeat courses.\n10004339201079×398 104 KB"
      },
      {
        "id": 615509,
        "post_number": 3,
        "username": "carlton",
        "created_at": "2025-04-05T09:14:57.220Z",
        "like_count": 0,
        "cooked": "TDS is the worst subject to repeat in order to improve CGPA.\nIts better to take a high credit, easy course to improve CGPA. We never recommend taking TDS for grade improvement. If you have passed it, its better to move on."
      },
      {
        "id": 619892,
        "post_number": 4,
        "username": "22f3000639",
        "created_at": "2025-04-15T18:16:37.635Z",
        "like_count": 0,
        "cooked": "@carlton\nSir, It is my humble request to kindly give atleast 2 bonus marks like any other subject, if i will get 2 marks as bonus my grade will stay good otherwise it will fall badly.\nSir plzzz it is my request."
      },
      {
        "id": 621126,
        "post_number": 5,
        "username": "carlton",
        "created_at": "2025-04-18T04:03:39.190Z",
        "like_count": 0,
        "cooked": "Just as matter of interest, even on campus IITM MTech students take foundation Python course from BS Program to artificially improve their on campus CGPA (they take it as an elective).\nSo if the CGPA is that big a deal, do an easy 4 credit course and get an S. Dont repeat hard subjects, thats just a waste of time."
      },
      {
        "id": 621128,
        "post_number": 6,
        "username": "carlton",
        "created_at": "2025-04-18T04:05:12.216Z",
        "like_count": 0,
        "cooked": "This is not up to us. We make adjustments within assignments and projects and we have done that already. For course level bonuses, that is the discretion of operations."
      }
    ]
  }
}
