{
  "id": 168142,
  "title": "ROE instructions request",
  "slug": "roe-instructions-request",
  "post_stream": {
    "posts": [
      {
        "id": 598470,
        "post_number": 1,
        "username": "23f2000573",
        "created_at": "2025-02-22T12:34:59.729Z",
        "like_count": 0,
        "cooked": "Hi TDS team, with ROE being ahead, i assume an official thread will be created soon. Here are few doubts from my side. I request the official post to cover these.\n\nSyllabus\nkindly hint us on the type of questions, kind of tools to practice\nI did my ROE the last term, the time was not enough for me. I would like to know if it is actually possible to solve all the questions within the time\nAny mock or resource to practice from?\nadditional tips, if any\n"
      },
      {
        "id": 598489,
        "post_number": 2,
        "username": "carlton",
        "created_at": "2025-02-22T13:09:52.956Z",
        "like_count": 0,
        "cooked": "\nModules 1 - 5\nQuestions will be similar to GAs and the content in the modules.\nROE is quite hard. Only a small number will be able to do it in the given time frame.\nWe will have some past ROEs as practise\n… watch sessions\n\nKind regards"
      },
      {
        "id": 598535,
        "post_number": 3,
        "username": "22f3002248",
        "created_at": "2025-02-22T14:58:22.135Z",
        "like_count": 0,
        "cooked": "Thanks for the answer @carlton\nIs it safe to assume that ROE is nothing but a “GA with extremely short deadline” since we don’t have proctors ? Or is the ROE more complex structured ?\nP.S. I am not saying the questions will be hard or easy, just asking about structure."
      },
      {
        "id": 598692,
        "post_number": 4,
        "username": "Rishabh2",
        "created_at": "2025-02-23T05:33:31.105Z",
        "like_count": 0,
        "cooked": "Sir questions will be of Numeeical type or MCQs type as in earlier batches it was MCQs??"
      },
      {
        "id": 598892,
        "post_number": 5,
        "username": "carlton",
        "created_at": "2025-02-24T07:40:15.196Z",
        "like_count": 0,
        "cooked": "ROEs are always unique. They can be of any kind. We do not fix one method. Therefore its not possible to say what kind of questions will be there whether MCQ, MSQ or numerical or text etc.\nKind regards"
      },
      {
        "id": 598895,
        "post_number": 6,
        "username": "carlton",
        "created_at": "2025-02-24T07:52:35.373Z",
        "like_count": 0,
        "cooked": "The ROEs are not GAs with short deadlines. A GA question usually tests one concept in isolation. ROEs typically require you to combine multiple concepts and use multiple tools in order to answer the question. (in a very short time).\nIf your goal is totally rely on the LLM to solve it for you… past experience shows us that ROEs complexity is usually difficult for an LLM to overcome without significant assistance from the “hooomann” \nSo practise with the concepts are going to be key without having to look up everything because looking up everything takes too much time. Collaboration with others is going be helpful. ROE is not proctored and is open internet. There is a reason for that. Its very hard.\nThere will be a dataset or multiple datasets. Sometimes you may have to combine datasets to answer questions. You will have to extract data from the dataset. You will have to transform/clean the data and you will have to gain some information from the data, is what typical ROEs test.\nKind regards"
      },
      {
        "id": 598902,
        "post_number": 7,
        "username": "Yogesh1",
        "created_at": "2025-02-24T08:39:53.315Z",
        "like_count": 0,
        "cooked": "Is there scope for collaboration in a 45 minute test?"
      },
      {
        "id": 598910,
        "post_number": 8,
        "username": "carlton",
        "created_at": "2025-02-24T08:59:27.794Z",
        "like_count": 0,
        "cooked": "Depends on the collaborators and how they split up the tasks. If its a team that knows their roles and a team leader that can designate tasks correctly then quite possibly. In practise though that rarely happens.\nAlso 45 mins is not a given, its a typical time we aim for. It can be shorter or longer depending on the nature of the questions in the ROE. Each one is unique. There have been ROEs as long as 2 hours and on the minimum side 30 mins."
      }
    ]
  }
}
