{
  "id": 171672,
  "title": "Why Failed?",
  "slug": "why-failed",
  "post_stream": {
    "posts": [
      {
        "id": 614919,
        "post_number": 1,
        "username": "virajpitale",
        "created_at": "2025-04-03T10:44:03.443Z",
        "like_count": 0,
        "cooked": "Screenshot 2025-04-03 1613021268×533 16.3 KB\nvirajpitale/tds-project1\non github you can clearly see i added mit license still it is showing failed"
      },
      {
        "id": 614922,
        "post_number": 2,
        "username": "Jivraj",
        "created_at": "2025-04-03T10:47:22.621Z",
        "like_count": 0,
        "cooked": "image1480×950 140 KB\nI checked your github repo MIT License file is named as Licenese.md but standard naming for License is LICENSE or LICENSE.md (with all caps)."
      },
      {
        "id": 614931,
        "post_number": 3,
        "username": "virajpitale",
        "created_at": "2025-04-03T11:00:47.042Z",
        "like_count": 0,
        "cooked": "So, should I edit the filename now, or will you count it as missing?"
      },
      {
        "id": 614963,
        "post_number": 4,
        "username": "virajpitale",
        "created_at": "2025-04-03T12:27:21.792Z",
        "like_count": 0,
        "cooked": "@Jivraj please reply"
      },
      {
        "id": 616586,
        "post_number": 5,
        "username": "virajpitale",
        "created_at": "2025-04-07T12:15:01.305Z",
        "like_count": 0,
        "cooked": "Screenshot 2025-04-07 1742561710×518 33 KB\nI submitted the project within the deadline, and I ensured that all requirements were fulfilled, including correctly adding the MIT License file. The license file was named properly and contained the correct content.\nHowever, I received a message stating that the MIT License was not present, and that the prerequisites were not completed — resulting in a failed status. This is surprising and feels unfair, as I’ve double-checked my submission and confirmed that everything, including the license file, is in place and named correctly.\nHere is my GitHub repo for your reference: GitHub - virajpitale/tds-project1\nI kindly request a re-evaluation of my submission, as I believe I’ve met all the required criteria. I would really appreciate your time in looking into this matter again.\nThank you for your understanding.\n@Jivraj"
      }
    ]
  }
}
