{
  "id": 168476,
  "title": "Concerns Regarding TDS Course Difficulty and Grading Fairness",
  "slug": "concerns-regarding-tds-course-difficulty-and-grading-fairness",
  "post_stream": {
    "posts": [
      {
        "id": 599766,
        "post_number": 1,
        "username": "A_LAKSHMI",
        "created_at": "2025-02-25T17:21:11.919Z",
        "like_count": 0,
        "cooked": "Dear @jkmadathil @Anand @Bharathi\nFirst and foremost, we sincerely appreciate the efforts of the TDS team in supporting us throughout this course. The live sessions and guidance have been helpful, and we recognize the intent to make this a valuable learning experience.\nHowever, despite these efforts, many of us have faced significant challenges in keeping up with the course expectations.\nKey Challenges Faced\n Lack of Prerequisites\nThis course did not list any prerequisites, leading many students—including those from non-technical backgrounds—to enroll with the expectation that they could keep up. However, the reality is that the course content, assignments, and projects have been far more complex than anticipated, making it difficult to manage.\n Project Complexity & Deadline Pressure\nThe difficulty of the projects has been overwhelming, requiring most of us to rely heavily on peer support just to meet the deadlines. Despite putting in our best efforts, many of us struggled to complete them successfully.\n Course Structure Changes & Misleading Past Feedback\nMany students joined TDS based on past Discourse posts and feedback, which suggested a different course structure. With the recent changes, it has been a tough transition—especially for working professionals and students without prior experience.\n Remote Open Exam (RoE) & Graded Assignments (GAs)\nWhile we have put in significant effort—spending 2-3 days on Graded Assignments (GAs) to secure good scores—we still find ourselves struggling to meet expectations for the projects and RoE, which are significantly harder than anticipated.\nWe completely understand the need to maintain academic standards, but we also hope fairness is considered. Since many of us are putting in our best efforts but still finding it hard to meet the course demands, we kindly request a revision of the grading pattern. Increasing the weightage of Graded Assignments (GAs) would help ensure that the dedication and hard work of students are fairly reflected in their grades. This would allow students to pass with a reasonable grade while still maintaining the integrity of the course.\nWe truly respect the effort that has gone into designing this course, and we are all here because we genuinely want to learn and grow. We only ask that the grading structure consider the diverse backgrounds of students so that everyone has a fair chance to succeed.\nThank you for your time and understanding. We appreciate your consideration and hope to find a way forward that benefits both students and the course objectives."
      },
      {
        "id": 599768,
        "post_number": 2,
        "username": "mahi.13",
        "created_at": "2025-02-25T17:23:19.102Z",
        "like_count": 0,
        "cooked": "Yes sir please look into this"
      },
      {
        "id": 599771,
        "post_number": 3,
        "username": "22f1000376",
        "created_at": "2025-02-25T17:25:59.673Z",
        "like_count": 0,
        "cooked": "@Anand @Bharathi Yes ma’am please pay attention to our concern."
      },
      {
        "id": 599772,
        "post_number": 4,
        "username": "Sakshi6479",
        "created_at": "2025-02-25T17:27:50.727Z",
        "like_count": 0,
        "cooked": "Yes sir, even it is tough for tech background students, just think about that how non-tech background students are handling the pressure for this course. Please consider this request.\n@carlton , @Saransh_Saini , @Jivraj , @Anand"
      },
      {
        "id": 599775,
        "post_number": 5,
        "username": "Rishabh2",
        "created_at": "2025-02-25T17:31:26.262Z",
        "like_count": 0,
        "cooked": "Yes @s.anand sir @jkmadathil  sir @Bharathi Mam,\nPlss look into this as this is becoming too too hectic ans stressful now Mam."
      },
      {
        "id": 599786,
        "post_number": 6,
        "username": "Sagan",
        "created_at": "2025-02-25T17:45:42.047Z",
        "like_count": 0,
        "cooked": "Right,\nI put 3 to 4 days on a GA. I still am not able to fully grasp the concept.\nI tried to attempt today’s mock roe, it was a disaster. I hope I can do better on next mock.\nI completed my project but due to some issue I failed to submit it. That’s was my mistake, and I highly regret it. I lost 20 marks because of it despite working so hard."
      },
      {
        "id": 599787,
        "post_number": 7,
        "username": "22f2001640",
        "created_at": "2025-02-25T17:49:47.969Z",
        "like_count": 0,
        "cooked": "Hi @s.anand @jkmadathil @Bharathi @carlton @Jivraj @Saransh_Saini\nCould you please look into the above issue?\nAdditionally, I’d like to highlight a concern regarding the current grading pattern ( JAN 2025 Term ) and overall course structuring:\nGrading Concerns\nFinal Course Score:\nT = 0.15GAA + 0.2 ROE1 + 0.2 P1 + 0.2 P2 + 0.25 F\n(The weightage of Projects + ROE accounts for 60% of the total score.)\nFrom the following Discourse post, it appears that the ROE exam is extremely difficult to the point of being considered “impossible” by students:\nWhat’s the actual purpose of impossible ROE exam?.\nGiven this, many students may directly lose 20 marks due to ROE, significantly impacting their overall scores.\nFurthermore, for Project 1 (deadline: 16th Feb 2025), guidance was provided only in the week of the deadline. This was highly inconvenient, as the live session did not effectively address all student concerns. As a result, many students are at risk of losing a valuable 20 marks for Project 1.\nCourse Structuring & Scheduling Issues\n\nMany students pursuing this course are dual-degree students or working professionals, making it challenging to keep up with live sessions and deadlines.\nThe last-minute guidance for projects adds unnecessary pressure, especially for those juggling work or other academic commitments.\nThe structuring and scheduling of sessions feel inappropriate, with crucial guidance sessions being held too late, making it difficult to implement feedback or clarify doubts in time.\n\nRequest for Improvement\nTo ensure a smoother learning experience, I request:\n\nEarly guidance and detailed instructions for Project 2, well in advance of the deadline.\nMore structured and accessible support, considering the diverse student base, including working professionals.\nBetter management of exam difficulty levels, ensuring that assessments are fair and reflect actual learning rather than being unnecessarily tough.\n\nI hope these concerns can be taken into account, and necessary improvements can be made. Looking forward to your response."
      },
      {
        "id": 599794,
        "post_number": 8,
        "username": "23f1002909",
        "created_at": "2025-02-25T17:55:29.035Z",
        "like_count": 0,
        "cooked": "Please look into it sir."
      },
      {
        "id": 599811,
        "post_number": 9,
        "username": "jkmadathil",
        "created_at": "2025-02-25T18:34:40.325Z",
        "like_count": 0,
        "cooked": "Thank you @A_LAKSHMI for the detailed post. This is much appreciated. Thought of quickly stepping in before Anand or other members from the course team gives a more detailed response.\nLet me be Open and Blunt to all in saying that the grading pattern will not be changed.  And the points below are some of quick things that came to my mind while reading the detailed listing of the challenges that have been put in the OP.\n\nTDS team have been tinkering with the course structure for the past 3 terms. You can check this Discourse thread where students have unanimously said that this is not an easy subject. In fact the first page of the TDS course GA1 itself should have given everyone an indication of what lies ahead. Anand has explicitly written down the below words:\n\n\nThis course is quite hard\nHere’s students’ feedback:\n\nIt used to be an easy course until 2024. # # #\nNow it’s hard and covers more. Take it in your last semester if possible. # # #\nPlan extra time. It takes more time than typical 3-credit courses. # # #\nLLMs grade you – unpredictably. # #\nThe ROE is hard. #\n\nTake Graded assignment 1 to check if you’re ready for this course. Please drop this course (do it in a later term) if you score low. It’ll be too tough for you now.\n\n\nTDS (or for that matter any course in this Degree program) is not supposed to be a single person effort. You should be realizing this even in your real life. A significant part of our learning process is social by nature. The only difference in this course is that we we explicitly encourage you to collaborate. If there is one main life lesson that we want you to learn out of this course then it is just this - Surviving tough situations require support all around us, and there is no shame in asking for help\nAgain to quote Anand:\n\n\nWe encourage learning by sharing\nYou CAN copy from friends. You can work in groups. You can share code. Even in projects, assignments, and exams (except the final end-term exam).\nWhy should you copy? Because in real life, there’s no time to re-invent the wheel. You’ll be working in teams on the shoulders of giants. It’s important to learn how to do that well.\nTo learn well, understand what you’re copying. If you’re short of time, prioritize.\nTo learn better, teach what you’ve learnt.\n\n\nNow will be a good point to reflect on the optimization problem of Grades versus Learning. The larger question for each of you is to consider the short-term advantage of better grades versus the long term advantage of improving the fundamentals related to tools usage (not just for Data Science, but in every day life itself).\nOnce again Anand has a nice blog where [I think] he is trying to explain that neither do we know nor do students realize what is going to ultimately benefit us. This is a journey that all of us are taking together, and we hope such open interactions along with the course will make the learning (or teaching) experience enjoyable  and internally make us more humble.\nWhether you like it or not, life is becoming more complex day by day. And unless you figure out your optimization strategy, it is going to be a bumpy ride. And this is true even for the TDS course team members. Each of us are also juggling multiple responsibilities (some even doing 4 projects in this term) while ensuring that needed support can be provided to the learners. This is not lighten the issues that any of you have highlighted here, but just to point out that there is no flowery path for anyone here.\nThen the major question will be, why are all of doing this crazy business of learning tools in this way. The simplest answer is - Tools are evolving day by day, and unless we realize that they are just “tools”, it is going to consume us an eternity to master them The point of all the exercises and assessments, is for you to understand the fundamental aspects related to a tool and figure out your own strategies for getting a grip on them.\n@22f2001640 Management of time and difficulty levels are a shared responsibility. All of you have been sufficiently warned that the learning process wont be easy. In fact we have released all major content well in advance, so that learners can benefit from early access. And from our side, we also have realized the supporting learners wouldn’t be easy. But I see that the TDS course team members have been putting their heart and soul in this course (and support), and even in this week they have prepared 3 sets of ROEs in order to ensure that all of you get enough practice opportunity.\n"
      },
      {
        "id": 599819,
        "post_number": 10,
        "username": "23f1002698",
        "created_at": "2025-02-25T21:19:52.440Z",
        "like_count": 0,
        "cooked": "Regarding your point of the short term benefits of grades vs the long term benefits of learning, I think I’m speaking for a lot of my peers that we’re not concerned about grades at this point, we just at least want to pass this course.\nI’m a standalone degree potential student and while I have learned a lot from the modules and do not condone dumbing it down, but at least after all this hard work I should be able to pass the course.\nWhile grades don’t matter in front of learning things but when passing the course itself is on the line then the learnings are overshadowed by the lack of marks. I want to invest myself in the ROE and the remaining project, but at this point I’m so frustrated about getting at least 40 that rather than a valuable learning experience, this course seems like a burden to me.\nI understand that the grading can’t be changed. All I hope and request that project 2 and end term turn out to be more approachable than project 1 and ROE so that after all this hard work, students like me at least get the privilege to pass."
      },
      {
        "id": 600121,
        "post_number": 11,
        "username": "Rrishit",
        "created_at": "2025-02-26T09:28:00.959Z",
        "like_count": 0,
        "cooked": "Nicely highlighted the concern of all students.\nTDS as a course has been really tedious this term. It’s a headache for those with non-technical background.\nIITM Management please look into this matter on urgent basis."
      },
      {
        "id": 600485,
        "post_number": 12,
        "username": "22f3002811",
        "created_at": "2025-02-26T19:19:58.232Z",
        "like_count": 0,
        "cooked": "Dam… Even when I have finished the course (with a B ) I’m still getting dragged into this   …"
      },
      {
        "id": 600486,
        "post_number": 13,
        "username": "22f3002811",
        "created_at": "2025-02-26T19:22:11.465Z",
        "like_count": 0,
        "cooked": "But still this is a huge Problem … \n\n\n\n jkmadathil:\n\nLLMs grade you – unpredictably. # #\n\n"
      },
      {
        "id": 600906,
        "post_number": 14,
        "username": "23f2001286",
        "created_at": "2025-02-27T16:59:38.492Z",
        "like_count": 0,
        "cooked": "Great! a nice post sir, I accept it is hard and I am harder than this too."
      },
      {
        "id": 600959,
        "post_number": 15,
        "username": "namanshyamsukha",
        "created_at": "2025-02-27T18:13:51.518Z",
        "like_count": 0,
        "cooked": "Truly agree with your point. It is hard. If the marking scheme is unpredictable, why not remove the whole grading system from this course. This is punishment even when you do learn. Hopefully, I would like a better grading system in future, even the course is designed very well!"
      },
      {
        "id": 601215,
        "post_number": 16,
        "username": "22f1000120",
        "created_at": "2025-02-28T13:31:40.672Z",
        "like_count": 0,
        "cooked": "Seeing the difficulty of TDS I feel like appying to Anand Sir’s company lol. I am barely surviving but enjoying every moment of it. But seriously though remembering everything is super difficult."
      },
      {
        "id": 601221,
        "post_number": 17,
        "username": "carlton",
        "created_at": "2025-02-28T13:48:45.642Z",
        "like_count": 0,
        "cooked": "You will survive. Just watch tonight’s session.  and prepare and practise."
      }
    ]
  }
}
