{
  "id": 168901,
  "title": "ROE Common Snippets Repo Feb 2025",
  "slug": "roe-common-snippets-repo-feb-2025",
  "post_stream": {
    "posts": [
      {
        "id": 601917,
        "post_number": 1,
        "username": "22f1000120",
        "created_at": "2025-03-01T21:00:35.056Z",
        "like_count": 0,
        "cooked": "\n\ngithub.com\n\n\n\n\nGitHub - ritwiktrivedi/ROE-Master-Snippets-File\nContribute to ritwiktrivedi/ROE-Master-Snippets-File development by creating an account on GitHub.\n\n\n\n\n\n\nThis is a repo some of us have been working on. It not complete but we are getting there. PRs are appreciated.\nThanks to the course team for giving us this idea of having snippets for common operations."
      },
      {
        "id": 601922,
        "post_number": 2,
        "username": "22f1000120",
        "created_at": "2025-03-01T21:08:47.201Z",
        "like_count": 0,
        "cooked": "I am too sleepy to work on it now… So seriously… PRs are not only appreciated but needed. Just add the basic parsing code or image manipulation for ga5. I will try and add in the morning but who doesn’t like Good PRs? Also mentioning @23f2005325 (Aishik) here for his wonderful PR which I have now merged."
      },
      {
        "id": 601930,
        "post_number": 3,
        "username": "23f2000573",
        "created_at": "2025-03-01T23:15:51.991Z",
        "like_count": 0,
        "cooked": "hi, thanks to you and the other contributors for the effort\ni have added llm week-3 codes through pull request. my code my not be perfect. but when I ran it in my laptop, it worked fine. pls do verify once before ROE"
      },
      {
        "id": 601969,
        "post_number": 4,
        "username": "22f1000120",
        "created_at": "2025-03-02T03:51:09.190Z",
        "like_count": 0,
        "cooked": "image401×374 21 KB\nThis looks beautiful "
      },
      {
        "id": 602335,
        "post_number": 5,
        "username": "22f1000120",
        "created_at": "2025-03-02T11:27:20.581Z",
        "like_count": 0,
        "cooked": "Failure is part of life. My laptop hanged and despite having all the needed resources I panicked and the exam went the way it went. I take this as a lesson. This resource will be refined further. I thank everyone involved. I am glad that many benefitted and were actually able to score well."
      }
    ]
  }
}
