{
  "id": 168449,
  "title": "Mock ROE 1, 2, 3, 4 [TDS Jan 2025]",
  "slug": "mock-roe-1-2-3-4-tds-jan-2025",
  "post_stream": {
    "posts": [
      {
        "id": 599595,
        "post_number": 1,
        "username": "carlton",
        "created_at": "2025-02-25T13:32:03.835Z",
        "like_count": 0,
        "cooked": "Dear Learner,\nUpdate 6\nHere is link to roe checklist file used in Friday(28 feb) session: ROE Checklist.docx - Google Docs\nAll the best\nTds team\nUpdate 5\n28/02/2025 1:05 pm\nDear Learner,\nPlease find the link to Mock ROE 4. This is the final Mock before actual ROE.\n\n\ndrive.google.com\n\n\n\nmock_roe_4.pdf\nGoogle Drive file.\n\n\n\n\n\nWe have a special session scheduled for tonight from 8pm to 10pm. We will be sharing some important information during that session which will help you for your ROE. It is available in your google calendar.\nThe meet link for that session is:\nROE Preparation - TDS\nFriday, February 28 · 8:00 – 10:00pm\nTime zone: Asia/Kolkata\nVideo call link: https://meet.google.com/nnq-sxqh-ryw\nThe session will be recorded and live streamed on YouTube.\nIt will be available on the TDS YouTube Playlist later.\nKind regards,\nTDS Team\nUpdate 4\n27/02/2025 7:18pm\nDear Learner,\nPlease find the link to Mock ROE 3 below. Note the datasets links are present inside the given document (there are more than 1):\n\n\ndrive.google.com\n\n\n\nMOCK ROE 3.pdf\nGoogle Drive file.\n\n\n\n\n\nThe estimated time for this Mock ROE 3 is 45 mins.\nAll the best,\nTDS Team\nUpdate 3\n26/02/2025 8:11 pm\nDear Learner\nPlease access the Mock ROE 2 at this link:\n\n\n\nexam.sanand.workers.dev\n\n\nTechnical Assessment\n\n\n\n\n\nThere is no time limit for this Mock. The expected time to solve this ROE is 45 mins. Set an alarm and try it.\nAfter the session at 9pm there will be a session where we will show you the solutions step by step (not like the previous session which was a demo of ROE).\nTo check your answers you will need to run the following script in the console.\ninputs = document.querySelectorAll('input')\ntextboxes = document.querySelectorAll(\"textarea\")\nbuttons = document.querySelectorAll(\"button\")\ninputs.forEach(input => input.removeAttribute('disabled'));\nbuttons.forEach(input => input.removeAttribute('disabled'));\ntextboxes.forEach(input => input.removeAttribute('disabled'));\n\nDo not submit or save your answers.\nAll the best!\nKind regards\nTDS Team\nUpdate 2\n26/02/2025 11:00 am\nWe will be releasing Mock 2 tonight on an exam portal at 8pm (no time limit).\nThe link for the Mock 2 will be available in this post as well as in the Seek Portal. An email will also be sent with the link to Mock 2.\nWe will be conducting a solving session at 9pm. This will be a regular teaching session (not like the first session on Tuesday 25/02/25 which was a real preview of what ROE looks like).\nKind regards,\nTDS Team\n\nUpdate 1\n25/02/2025 7:46pm\nWe have now closed the mock submissions.\nBoth the dataset and the form submissions will reopen after tonights live session.\n\nAnnouncement\n25/02/2025\nThis same information is available in the seek portal as well.\nThe data for Mock ROE 1 is available at this link:\nJivraj-18/tds-jan-2025-mock-roe-1\nThe questions for Mock ROE 1 is available at this link:\nhttps://forms.gle/UWhvLQvjrJmnvMSn6\nIMPORTANT: We will accept only a single submission of the Mock Question Form. Solve all the questions first, and then fill the form and make a single submission at the end.\nThe form submission will be temporarily closed after 8pm.\nWe have provided this for you to test yourself. The expected time to complete this Mock ROE is 45 mins.\nWe will allow access to the Mock ROE and the question form after the live solving session tonight.\nAll the best!"
      },
      {
        "id": 599596,
        "post_number": 2,
        "username": "carlton",
        "created_at": "2025-02-25T13:32:15.454Z",
        "like_count": 0,
        "cooked": ""
      },
      {
        "id": 599598,
        "post_number": 3,
        "username": "22f2001640",
        "created_at": "2025-02-25T13:39:40.411Z",
        "like_count": 0,
        "cooked": "Should we use data mentioned in headline of form or mail data. ?"
      },
      {
        "id": 599612,
        "post_number": 4,
        "username": "24ds3000028",
        "created_at": "2025-02-25T13:58:19.934Z",
        "like_count": 0,
        "cooked": "From where can I get today’s live sessions link"
      },
      {
        "id": 599620,
        "post_number": 5,
        "username": "carlton",
        "created_at": "2025-02-25T14:09:41.427Z",
        "like_count": 0,
        "cooked": "either is fine. Both have the same data but slightly different presentations"
      },
      {
        "id": 599621,
        "post_number": 6,
        "username": "carlton",
        "created_at": "2025-02-25T14:10:15.004Z",
        "like_count": 0,
        "cooked": "From google calendar\n\n\nGoogle Workspace\n\n\n\nShareable Online Calendar and Scheduling - Google Calendar\nUse Google Calendar to share meetings and schedule appointments, for managing what matters in your business and personal life, with Google Workspace.\n\n\n\n\n\nYou should subscribe to tds calendar. Its available in the TDS Portal\nmeet.google.com/odh-ycbm-ahj"
      },
      {
        "id": 599627,
        "post_number": 7,
        "username": "22f2001640",
        "created_at": "2025-02-25T14:18:08.670Z",
        "like_count": 0,
        "cooked": "form link not working"
      },
      {
        "id": 599628,
        "post_number": 8,
        "username": "carlton",
        "created_at": "2025-02-25T14:18:50.402Z",
        "like_count": 0,
        "cooked": "Yes we close it at 7:45pm\nWe will reopen after live session tonight.\nIts a timed mock."
      },
      {
        "id": 599630,
        "post_number": 9,
        "username": "22f2001640",
        "created_at": "2025-02-25T14:19:32.437Z",
        "like_count": 0,
        "cooked": "atleast close 5 mins early I would have copied the questions"
      },
      {
        "id": 599634,
        "post_number": 10,
        "username": "shubhamatkal",
        "created_at": "2025-02-25T14:31:01.026Z",
        "like_count": 0,
        "cooked": "live session gmeet link is not available?"
      },
      {
        "id": 599656,
        "post_number": 11,
        "username": "Sagan",
        "created_at": "2025-02-25T14:44:59.458Z",
        "like_count": 0,
        "cooked": "After seeing the Mock, I have to say, please give more time for ROE exam, anything less than 1 hour seems extremely difficult."
      },
      {
        "id": 599752,
        "post_number": 12,
        "username": "shubhamatkal",
        "created_at": "2025-02-25T16:41:32.061Z",
        "like_count": 0,
        "cooked": "where can we find link for recording of live session which happened after this mock roe ?\nthanks"
      },
      {
        "id": 599758,
        "post_number": 13,
        "username": "Sagan",
        "created_at": "2025-02-25T17:02:29.814Z",
        "like_count": 0,
        "cooked": "When will it reopen?"
      },
      {
        "id": 599845,
        "post_number": 14,
        "username": "23f2003413",
        "created_at": "2025-02-26T03:30:22.514Z",
        "like_count": 0,
        "cooked": "dear @carlton\nwhen will yesterday’s recorded session on mock ROE 1 be uploaded on YouTube?"
      },
      {
        "id": 599854,
        "post_number": 15,
        "username": "carlton",
        "created_at": "2025-02-26T03:58:19.216Z",
        "like_count": 0,
        "cooked": "@23f2003413\nWe will have it uploaded sometime this morning.\nIt has two parts to it. The first part is the TAs solving the Mock in real time (however this is not a solutions session). The purpose of it is to get you to realise some key things:\n\nThe chaos of ROE.\nThe adrenaline, speed of thought, the need to be very familiar with your tools.\nThe limited time you have to use GPT effectively. It will help you with minor work flows, but not with complex tasks. (watch the session debrief to hear a clear articulation about this).\nThe value of efficient and effective collaboration. A hodgepodge of many people will not make an effective solutions team.\nThe ABSOLUTE importance of creating your own cheat sheet with code snippets that will help you solve ROE quickly\nWorkflow of ROE: Data Extraction → Data Cleaning → Data Transformation → Data Analyisis → Information to answer questions\nThe pitfalls of getting fixated on a question (a very common mistake and you can see it happen in the real time solving session as well).\nHow limited the time is.\n\nThe second part of the session was a debrief for the sheer shock that students felt. The goal of the mock was to acclimatise you to the shock of ROE.\nPast terms never had this benefit. We thought to take the shock factor out so that you can be better prepared than any term before. Emotions were raw. But this is normal. What is unusual is to have a preview of it before ROE. So the discussions were very intense even for us.\nToday’s Mock ROE will be more like a traditional solving session and deal with new aspects. It has the added bonus of being hosted on an exam server (without a time limit).\nI would still STRONGLY advise setting a horrible sounding alarm to acclimatise to the pressure cooker of ROE. You will make stupid mistakes under pressure. The TAs did yesterday as well. So best to reduce this factor by getting used to the clock.\nKind regards"
      },
      {
        "id": 599855,
        "post_number": 16,
        "username": "carlton",
        "created_at": "2025-02-26T03:58:46.473Z",
        "like_count": 0,
        "cooked": ""
      },
      {
        "id": 599857,
        "post_number": 17,
        "username": "23f2003413",
        "created_at": "2025-02-26T04:02:53.908Z",
        "like_count": 0,
        "cooked": "Thank you! will check out the session today"
      },
      {
        "id": 600114,
        "post_number": 19,
        "username": "shubhamatkal",
        "created_at": "2025-02-26T09:16:29.955Z",
        "like_count": 0,
        "cooked": "Hello @carlton sir , for me given constituency was \"SRI GOBINDPUR\"\nand in the dataset there are multiple names for this constituency i think over the period names were changed of this constituency\ni have filtered constituencies from punjab using below code in colab\ndf_gobindpur = df[df[\"AC\"].str.contains(\"SRI GOBINDPUR|SRIHARGOBINDPUR|SRI HARGOBINDPUR\", case=False, na=False)]\n\nis this correct approach or i have to consider only SRI GOBINDPUR name only? but then this constituency is not availble after 1957\nusing above filtering i got below data for SRI GOBINDPUR\n\ndrive.google.com\n\n\n\ndf_gobindpur.csv\nGoogle Drive file.\n\n\n\n\n\nthen i used margin formula as\nmargin_percentage = ((winner_votes - runner_up_votes) / total_votes) * 100\n\nusing this i got answer for 1st question as\nYEAR                              1992\nAC                   4 SRIHARGOBINDPUR\nWINNER                  1 GURNAM SINGH\nWINNER_PARTY                       CPI\nWINNER_VOTES                    5000.0\nRUNNER_UP               2 MUSTAK MASIH\nRUNNER_UP_PARTY                    INC\nRUNNER_UP_VOTES                 1115.0\nMARGIN_PERCENTAGE            50.599114\n\nwhich is 50.60 , but answer is 62.64\npls guide where i might be wrong, thanks"
      },
      {
        "id": 600276,
        "post_number": 20,
        "username": "Jivraj",
        "created_at": "2025-02-26T11:23:42.616Z",
        "like_count": 0,
        "cooked": "\n\n\n shubhamatkal:\n\ndf_gobindpur = df[df[\"AC\"].str.contains(\"SRI GOBINDPUR|SRIHARGOBINDPUR|SRI HARGOBINDPUR\", case=False, na=False)]\n\n\n\nFor this kind of name difference you can use Openrefine software\n\n\n\n shubhamatkal:\n\nwhich is 50.60 , but answer is 62.64\n\n\nThat answer is wrong, we will be releasing a script with correct python snippets.\nKind regards."
      },
      {
        "id": 600302,
        "post_number": 21,
        "username": "23f2005138",
        "created_at": "2025-02-26T12:47:56.303Z",
        "like_count": 0,
        "cooked": "@Jivraj @carlton\n“SATHUPALLE” and “NILANGA” were two of the four constituencies which were assigned to me. However, even with phonetic match, I couldn’t find any data for these.  Closest I could find to SATHUPALLE is “Sattenapalle”, however, two are different locations 150km+ apart as per google maps. Are these really in the dataset?\n"
      }
    ]
  }
}
